Revit 2027 API
ModelPath.GetModelGUID Method
 A GUID identifying the Revit cloud model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetModelGUID()
Public Function GetModelGUID As Guid
public:
Guid GetModelGUID()
member GetModelGUID : unit -> Guid
Return Value
Guid
See Also
Reference
ModelPath Class
Autodesk.Revit.DB Namespace